<?php
// +----------------------------------------------------------------------
// | ShopXO 国内领先企业级B2C免费开源电商系统
// +----------------------------------------------------------------------
// | Copyright (c) 2011~2099 http://shopxo.net All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( https://opensource.org/licenses/mit-license.php )
// +----------------------------------------------------------------------
// | Author: Devil
// +----------------------------------------------------------------------

/**
 * 模块语言包-俄语
 * @author   Devil
 * @blog     http://gong.gg/
 * @version  0.0.1
 * @datetime 2016-12-01T21:51:08+0800
 */
return [
    // 文章
    'article'           => [
        'article_no_data_tips'                  => 'Статья не существует или удалена.',
        'article_id_params_tips'                => 'Ошибка с идентификатором статьи',
    ],
    // 订单管理
    'order'             => [
        'form_you_have_commented_tips'          => 'Вы сделали комментарий.',
    ],
];
?>