<?php
// +----------------------------------------------------------------------
// | ShopXO 国内领先企业级B2C免费开源电商系统
// +----------------------------------------------------------------------
// | Copyright (c) 2011~2018 http://shopxo.net All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: Devil
// +----------------------------------------------------------------------

// 首页
// Route::get('/', 'index/index');

// // 商品详情
// Route::get('goods-:id', 'index/goods/index');

// // 搜索
// Route::get('search-:category_id', 'index/search/index');
?>